PNP_Navier_Stokes_Foam/EOF_solve/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application Diode_Foam;

startFrom       latestTime;

stopAt          endTime;

endTime         1e7;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   1e5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

functions
{
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1000;

        fields
        (
            Phi
	    C1	
	    C2
	    I
	    rho_e
	    U
	   electricField
           p
        );

        probeLocations
        (
          (500.000000 0.000000 0.000000) 
(500.000000 0.166641 0.000000) 
(500.000000 0.333283 0.000000) 
(500.000000 0.499924 0.000000) 
(500.000000 0.666565 0.000000) 
(500.000000 0.833206 0.000000) 
(500.000000 0.999848 0.000000) 
(500.000000 1.166489 0.000000) 
(500.000000 1.333130 0.000000) 
(500.000000 1.499772 0.000000) 
(500.000000 1.666413 0.000000) 
(500.000000 1.833054 0.000000) 
(500.000000 1.999695 0.000000) 
(500.000000 2.166337 0.000000) 
(500.000000 2.332978 0.000000) 
(500.000000 2.499619 0.000000) 
(500.000000 2.666260 0.000000) 
(500.000000 2.832902 0.000000) 
(500.000000 2.999543 0.000000) 
(500.000000 12.938029 0.000000) 
(500.000000 22.876515 0.000000) 
(500.000000 32.815001 0.000000) 
(500.000000 42.753487 0.000000) 
(500.000000 52.691973 0.000000) 
(500.000000 62.630459 0.000000) 
(500.000000 72.568945 0.000000) 
(500.000000 82.507431 0.000000) 
(500.000000 92.445916 0.000000) 
(500.000000 102.384402 0.000000) 
(500.000000 112.322888 0.000000) 
(500.000000 122.261374 0.000000) 
(500.000000 132.199860 0.000000) 
(500.000000 142.138346 0.000000) 
(500.000000 152.076832 0.000000) 
(500.000000 162.015318 0.000000) 
(500.000000 171.953804 0.000000) 
(500.000000 181.892290 0.000000) 
(500.000000 191.830776 0.000000) 
(500.000000 201.769262 0.000000) 
(500.000000 211.707748 0.000000) 
(500.000000 221.646234 0.000000) 
(500.000000 231.584720 0.000000) 
(500.000000 241.523206 0.000000) 
(500.000000 251.461692 0.000000) 
(500.000000 261.400177 0.000000) 
(500.000000 271.338663 0.000000) 
(500.000000 281.277149 0.000000) 
(500.000000 291.215635 0.000000) 
(500.000000 301.154121 0.000000) 
(500.000000 311.092607 0.000000) 
(500.000000 321.031093 0.000000) 
(500.000000 330.969579 0.000000) 
(500.000000 340.908065 0.000000) 
(500.000000 350.846551 0.000000) 
(500.000000 360.785037 0.000000) 
(500.000000 370.723523 0.000000) 
(500.000000 380.662009 0.000000) 
(500.000000 390.600495 0.000000) 
(500.000000 400.538981 0.000000) 
(500.000000 410.477466 0.000000) 
(500.000000 420.415953 0.000000) 
(500.000000 430.354438 0.000000) 
(500.000000 440.292924 0.000000) 
(500.000000 450.231410 0.000000) 
(500.000000 460.169896 0.000000) 
(500.000000 470.108382 0.000000) 
(500.000000 480.046868 0.000000) 
(500.000000 489.985354 0.000000) 
(500.000000 499.923840 0.000000) 


(10000.325000 0.000000 0.000000) 
(10000.325000 0.166641 0.000000) 
(10000.325000 0.333283 0.000000) 
(10000.325000 0.499924 0.000000) 
(10000.325000 0.666565 0.000000) 
(10000.325000 0.833206 0.000000) 
(10000.325000 0.999848 0.000000) 
(10000.325000 1.166489 0.000000) 
(10000.325000 1.333130 0.000000) 
(10000.325000 1.499772 0.000000) 
(10000.325000 1.666413 0.000000) 
(10000.325000 1.833054 0.000000) 
(10000.325000 1.999695 0.000000) 
(10000.325000 2.166337 0.000000) 
(10000.325000 2.332978 0.000000) 
(10000.325000 2.499619 0.000000) 
(10000.325000 2.666260 0.000000) 
(10000.325000 2.832902 0.000000) 
(10000.325000 2.999543 0.000000) 

(19500.650000 0.000000 0.000000) 
(19500.650000 0.166641 0.000000) 
(19500.650000 0.333283 0.000000) 
(19500.650000 0.499924 0.000000) 
(19500.650000 0.666565 0.000000) 
(19500.650000 0.833206 0.000000) 
(19500.650000 0.999848 0.000000) 
(19500.650000 1.166489 0.000000) 
(19500.650000 1.333130 0.000000) 
(19500.650000 1.499772 0.000000) 
(19500.650000 1.666413 0.000000) 
(19500.650000 1.833054 0.000000) 
(19500.650000 1.999695 0.000000) 
(19500.650000 2.166337 0.000000) 
(19500.650000 2.332978 0.000000) 
(19500.650000 2.499619 0.000000) 
(19500.650000 2.666260 0.000000) 
(19500.650000 2.832902 0.000000) 
(19500.650000 2.999543 0.000000) 
(19500.650000 4.879257 0.000000) 
(19500.650000 6.758970 0.000000) 
(19500.650000 8.638684 0.000000) 
(19500.650000 10.518398 0.000000) 
(19500.650000 12.398111 0.000000) 
(19500.650000 14.277825 0.000000) 
(19500.650000 16.157538 0.000000) 
(19500.650000 18.037252 0.000000) 
(19500.650000 19.916966 0.000000) 
(19500.650000 21.796679 0.000000) 
(19500.650000 23.676393 0.000000) 
(19500.650000 25.556107 0.000000) 
(19500.650000 27.435820 0.000000) 
(19500.650000 29.315534 0.000000) 
(19500.650000 31.195248 0.000000) 
(19500.650000 33.074961 0.000000) 
(19500.650000 34.954675 0.000000) 
(19500.650000 36.834389 0.000000) 
(19500.650000 38.714102 0.000000) 
(19500.650000 40.593816 0.000000) 
(19500.650000 42.473529 0.000000) 
(19500.650000 44.353243 0.000000) 
(19500.650000 46.232957 0.000000) 
(19500.650000 48.112670 0.000000) 
(19500.650000 49.992384 0.000000) 
            
        );

    }

    }

    }

// ************************************************************************* //








// ************************************************************************* //

// ************************************************************************* //

