PNP_Navier_Stokes_Foam/EOF_solve/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet           
    {
             type            zeroGradient;
    }

    outlet          
    {
        type            zeroGradient;
    }

     micropore_upperwall        
    {
          type            fixedValue;
        value           uniform (0 0 0);
    }

     nanopore_upperwall       
    {
           type            fixedValue;
        value           uniform (0 0 0);
    }

 micropore_side_upperwall    
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
 axis
    {
        type            empty;
    }
   
   
     front
    {
        type            wedge;
    }

   back
    {
        type            wedge;
    }
}

// ************************************************************************* //
