PNP_Navier_Stokes_Foam/EOF_solve/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 14.855;
    }

    outlet          
    {
        type            zeroGradient;
    }

     micropore_upperwall      
    {
        type            zeroGradient;
    }

    nanopore_upperwall       
    {
        type            zeroGradient;
    }

micropore_side_upperwall  
    {
        type            zeroGradient;
    }
  axis
    {
        type            empty;
    }
   
   
     front
    {
        type            wedge;
    }

   back
    {
        type            wedge;
    }
}

// ************************************************************************* //
